# SpecTypeId.Reference Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SpecTypeId..::..Reference Properties
SpecTypeId..::..Reference Class See Also
---
The SpecTypeId..::..Reference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Image | Image, in discipline Common. |
| LoadClassification | Load Classification, in discipline Electrical. |
| Material | Material, in discipline Common. |

# See Also
SpecTypeId..::..Reference Class
Autodesk.Revit.DB Namespace